{
  "blog.title": "کثیر لسانی ایپ NextJS، i18next اور Myelin AI کے ساتھ",
  "blog.description": "اس ٹیوٹوریل میں ہم سیکھیں گے کہ i18next اور میائلن AI کا استعمال کرتے ہوئے اپنے NextJS ایپ کو متعدد زبانوں میں کس طرح ترجمہ کرنا ہے۔",
  "titleOne": "حصہ A: فرنٹ اینڈ",
  "stepOne.title": "مرحلہ 1: NextJS پروجیکٹ بنائیں",
  "stepOne.paragraphOne": "ہم ایک نئے Next.js پروجیکٹ شروع کرنے کے لیے یہ کمانڈ چلائیں گے.",
  "stepTwo.title": "مرحلہ 2: چادکن شامل کریں",
  "stepTwo.paragraphOne": "اگلا، آئیے چادکن کو ہمارے منصوبے میں شامل کریں۔ مایلین چادکن سے بہت متاثر ہے اور اپنی مرضی کے مطابق اجزاء بنانے کے لیے اس کے بہت سے پرائمٹیوز کا استعمال کرتا ہے، جیسے زبان تبدیل کرنے والا۔",
  "stepThree.title": "مرحلہ 3: مقامی زبانیں شامل کریں",
  "stepThree.paragraphOne": "اگلا، آئیے ہماری درخواست میں مقامی زبانیں شامل کریں۔ ہم locales/en ڈائریکٹری کے اندر common.json نامی ایک واحد نامی مقامی زبان بنانے جا رہے ہیں۔ Myelin دونوں نامی اور غیر نامی مقامی زبانوں کی حمایت کرتا ہے۔ لیکن میں آپ کو انتہائی مشورہ دیتا ہوں کہ آپ نامی مقامی زبانوں پر قائم رہیں۔",
  "stepFour.title": "قدم 4: i18next کی بنیاد کا کوڈ شامل کریں",
  "stepFour.paragraphOne": "اگلے، آئیے اپنے ایپ میں i18n-next اور اس کے دوستوں کو شامل کریں۔ ہم ایسا کرنے کے لیے مندرجہ ذیل کمانڈ کا استعمال کر سکتے ہیں:",
  "stepFour.paragraphTwo": "یہ چلانے سے مندرجہ ذیل ہوگا:",
  "stepFour.paragraphThree": "بنیادی i18next لائبریری اور زبان کی شناخت، پچھلے زنجیر، اور وسائل کی تبدیلی کے لیے اضافی ماڈیولز کو انسٹال کریں۔",
  "stepFour.paragraphFour": "libs/i18n-next ڈائریکٹری میں مختلف افادیت کے افعال اور اجزاء کو نافذ کریں، جن میں کوکی کا انتظام، زبان کی شناخت، تشکیل، فراہم کنندگان، اور ترجمہ کی فعالیت کے لیے حسب ضرورت ہکس شامل ہیں۔",
  "stepFive.title": "قدم 5: لے آؤٹ.tsx کو لپیٹیں",
  "stepFive.paragraphOne": "ہم لے آؤٹ کمپوننٹ کو I18NextHtmlProvider سے لپیٹنے والے ہیں",
  "stepSix.title": "قدم 6: اقسام بنائیں",
  "stepSix.paragraph": "اس سے پہلے کہ ہم ترجموں کا استعمال کرنا شروع کریں، آئیے اقسام بنائیں۔ یہ ہمیں useTranslation ہک کے استعمال میں قسم کی مکمل معلومات فراہم کرنے میں مدد دے گا۔ ہم npx myelino upsert چلا سکتے ہیں اور i18next.d.ts کا انتخاب کر سکتے ہیں۔ یہ قسم کی مخصوص معلومات types ڈائریکٹری کے تحت تیار کرے گا.",
  "stepSeven.title": "مرحلہ 7: ترجمے استعمال کریں",
  "stepSeven.paragraphOne": "حسب ضرورت اقسام تیار ہونے کے ساتھ، ہم حسب ضرورت useTranslation ہک کا اس طرح استعمال کر سکتے ہیں:",
  "stepSeven.paragraphTwo": "آپ کو نامزدگیوں کے لکھنے پر قسم کی تکمیل نظر آئے گی۔ یہ اس سے پہلے ہیں جب ہم پچھلے مرحلے میں اقسام تیار کر رہے تھے۔",
  "stepSeven.paragraphThree": "ہم frontend کے حصے کے ساتھ ختم ہو چکے ہیں۔ اب تفریحی حصہ، Myelin AI کے ساتھ کثیر لسانی ترجمے."
}
