{
  "blog.title": "نیراہی زبانوں میں ایپ کے ساتھ نیسٹ جے ایس، i18next اور مائلیئن اے آئی",
  "blog.description": "اس ٹیوٹوریل میں، ہم سیکھیں گے کہ اپنے نیسٹ جے ایس ایپ کو متعدد زبانوں میں i18next اور مائلیئن اے آئی کا استعمال کرتے ہوئے کیسے ترجمہ کریں۔",
  "titleOne": "حصہ A: فرنٹ اینڈ",
  "stepOne.title": "قدم 1: نیسٹ جے ایس پروجیکٹ بنائیں",
  "stepOne.paragraphOne": "ہم ایک نئے نیسٹ جے ایس پروجیکٹ کا آغاز کرنے کے لیے یہ کمانڈ چلائیں گے۔",
  "stepTwo.title": "قدم 2: چادکن شامل کریں",
  "stepTwo.paragraphOne": "اب، آئیے چادکن کو اپنے منصوبے میں شامل کریں۔ مائلیئن چادکن سے بہت متاثر ہے اور اپنی خود کی کمپیوننٹس جیسے زبان کے تبدیلی کی تخلیق کے لیے اس کے بہت سے بنیادیوں کا استعمال کرتا ہے۔",
  "stepThree.title": "قدم 3: مقامی زبانیں شامل کریں",
  "stepThree.paragraphOne": "اب، آئیے اپنی ایپلی کیشن میں مقامی زبانیں شامل کریں۔ ہم 'locales/en' ڈائریکٹری میں 'common.json' نام کی ایک واحد مقامی زبان تخلیق کرنے جا رہے ہیں۔ مائلیئن دونوں مقامی اور غیر مقامی زبانوں کی حمایت کرتا ہے لیکن میں آپ کو مقامی زبانوں پر قائم رہنے کی سختی سے سفارش کرتا ہوں۔",
  "stepFour.title": "قدم 4: i18next کا بنیادی کوڈ شامل کریں",
  "stepFour.paragraphOne": "اب آئیے اپنے ایپ میں i18n-next اور دیگر کو شامل کریں۔ ہم اس کے لیے مندرجہ ذیل کمانڈ استعمال کر سکتے ہیں:",
  "stepFour.paragraphTwo": "یہ چلانے سے یہ ہوگا:",
  "stepFour.paragraphThree": "زبان کی شناخت، بیک اینڈ چیننگ، اور وسائل کی تبدیلی کے لیے بنیادی i18next لائبریری اور اضافی ماڈیولز انسٹال کریں۔",
  "stepFour.paragraphFour": "libs/i18n-next ڈائریکٹری میں کوکی کی انتظامیہ، زبان کی شناخت، تشکیل، فراہم کنندگان، اور ترجمے کی فعالیت کے لیے حسب ضرورت ہوکس سمیت مختلف افادیت کی افعال اور کمپوننٹس کو نافذ کریں۔",
  "stepFive.title": "قدم 5: layout.tsx کو لپیٹیں",
  "stepFive.paragraphOne": "ہم layout کمپوننٹ کو I18NextHtmlProvider کے ساتھ لپیٹنے جا رہے ہیں۔",
  "stepSix.title": "قدم 6: اقسام جنریٹ کریں",
  "stepSix.paragraph": "ترجمے کا استعمال شروع کرنے سے پہلے، آئیے اقسام جنریٹ کریں۔ یہ ہمیں useTranslation ہوک کے استعمال کے وقت قسم کی تکمیل میں مدد کرے گا۔ ہم npx myelino upsert چلا سکتے ہیں اور i18next.d.ts منتخب کر سکتے ہیں۔ یہ types ڈائریکٹری کے تحت حسب ضرورت اقسام جنریٹ کرے گا۔",
  "stepSeven.title": "قدم 7: ترجمے کا استعمال کریں",
  "stepSeven.paragraphOne": "حسب ضرورت اقسام جنریٹ ہونے کے ساتھ، ہم حسب ضرورت useTranslation ہوک کا استعمال کر سکتے ہیں:",
  "stepSeven.paragraphTwo": "آپ namespaces میں ٹائپ کی تکمیل کی نوٹ کریں گے۔ یہ اس سے پہلے ہے جب ہم نے پچھلے قدم میں اقسام جنریٹ کیں۔",
  "stepSeven.paragraphThree": "ہم فرنٹ اینڈ کے حصے کے ساتھ ختم ہو چکے ہیں۔ اب مزے کا حصہ، مائلیئن اے آئی کے ساتھ متعدد زبانوں کے ترجمے۔",
  "partTwo.title": "حصہ B: مائلیئن اے آئی کے ساتھ کثیر زبانی ترجمہ",
  "partTwo.intro": "تعارف",
  "partTwo.intro.paragraphOne": "ٹھیک ہے، اب ہمارے پاس فرنٹ اینڈ ہے، ہم مائلیئن کے ساتھ اپنی ترجمہ بنیادی ڈھانچوں کو شروع کرنے کے لیے تیار ہیں۔",
  "partTwo.intro.paragraphTwo": "مائلیئن ایک اوپن سورس مقامی پہلی ترجمہ بنیادی ڈھانچہ ہے، جو متعدد زبانوں کے ترجمے کا انتظام، ہم آہنگی اور چلانا انتہائی آسان بنا دیتا ہے۔ اس کا استعمال شروع کرنے کا پہلا قدم اسے ابتدائی طور پر ترتیب دینا ہے۔",
  "partTwo.intro.paragraphThree": "آپ سے پوچھا جائے گا کہ ماخذ ترجمہ، ہدف ترجمے اور آپ کے انتخاب کا AI سروس فراہم کنندہ فراہم کریں۔ اگر آپ چاہیں تو آپ حسب ضرورت AI فراہم کنندہ بھی شامل کر سکتے ہیں۔ چیزوں کو سادہ رکھنے کے لیے، ہم openai کا انتخاب کریں گے۔",
  "partTwo.intro.paragraphFour": "آپ کو اپنے API کیز بھی حاصل کرنے کی ضرورت ہوگی اور انہیں .env فائل میں محفوظ کرنا ہوگا۔",
  "partTwo.translate.title": "ترجمہ کریں",
  "partTwo.translate.paragraphOne": "اب ہم ترجمہ پائپ لائن چلانے کے لیے تیار ہیں۔ ہم یہ مندرجہ ذیل کمانڈ کے ساتھ کر سکتے ہیں",
  "partTwo.translate.paragraphTwo": "جب آپ یہ کمانڈ چلائیں گے، تو مائیلین آپ کی ماخذ JSON فائلیں (جیسے، locales/en/common.json) لوڈ کرتا ہے، کسی بھی نئے یا اپ ڈیٹ شدہ ترجمہ کی تاروں کی شناخت کرتا ہے، آپ کی مخصوص ہدف زبانوں کے لیے ترجمے تیار کرتا ہے، اور متعلقہ ہدف زبان کی JSON نامی فائلوں (جیسے، locales/fr/common.json، locales/es/common.json، locales/zh/common.json) کو تخلیق یا اپ ڈیٹ کرتا ہے۔",
  "partTwo.translate.paragraphThree": "یہ چیک کرنے کے لیے کہ آیا یہ واقعی کام کر رہا ہے، ہم زبان سوئچر کمپوننٹ درآمد کرسکتے ہیں۔",
  "partTwo.translate.note": "یہ چیک کرنے کے لیے کہ آیا یہ واقعی کام کر رہا ہے، ہم زبان سوئچر کمپوننٹ درآمد کرسکتے ہیں۔",
  "conclusion": "اور بس، آپ نے اپنے چادکن طرز کے ساتھ اپنا ملٹی لنگوئل ایپ بنایا ہے۔ شاباش!"
}
