{
  "blog.title": "मल्टी लिंगुअल ऐप के साथ NextJS, i18next और Myelin AI",
  "blog.description": "इस ट्यूटोरियल में हम अपने NextJS ऐप को i18next और Myelin AI का उपयोग करके कई भाषाओं में अनुवाद करना सीखेंगे।",
  "titleOne": "भाग ए: फ्रंटएंड",
  "stepOne.title": "चरण 1: NextJS प्रोजेक्ट बनाएं",
  "stepOne.paragraphOne": "हम इस कमांड को चलाकर एक नया NextJS प्रोजेक्ट शुरू करेंगे।",
  "stepTwo.title": "चरण 2: चाडसीएन जोड़ें",
  "stepTwo.paragraphOne": "अगला, चलिए चाडसीएन को अपने प्रोजेक्ट में जोड़ते हैं। Myelin चाडसीएन से बहुत प्रेरित है और इसके कई प्राथमिकताओं का उपयोग कस्टम घटक जैसे भाषा-स्विचर बनाने के लिए करता है।",
  "stepThree.title": "चरण 3: स्थानीयताओं को जोड़ें",
  "stepThree.paragraphOne": "अगला, चलिए अपने ऐप में स्थानीयताओं को जोड़ते हैं। हम locales/en निर्देशिका के अंदर common.json नामक एक एकल नामित स्थानीयता बनाएंगे। Myelin दोनों नामित और गैर-नामित स्थानीयताओं का समर्थन करता है। लेकिन मैं आपको नामित स्थानीयताओं पर टिके रहने की अत्यधिक सिफारिश करता हूँ।",
  "stepFour.title": "चरण 4: i18next बॉयलरप्लेट कोड जोड़ें",
  "stepFour.paragraphOne": "अगला चलिए अपने ऐप में i18next और उसके मित्रों को जोड़ते हैं। हम ऐसा करने के लिए निम्नलिखित कमांड का उपयोग कर सकते हैं:",
  "stepFour.paragraphTwo": "यह चलाने से निम्नलिखित होगा:",
  "stepFour.paragraphThree": "कोर i18next लाइब्रेरी और भाषा पहचान, बैकएंड चेनिंग, और संसाधन रूपांतरण के लिए अतिरिक्त मॉड्यूल स्थापित करें।",
  "stepFour.paragraphFour": "libs/i18next निर्देशिका में विभिन्न उपयोगिताओं और घटकों को लागू करें, जिसमें कुकी प्रबंधन, भाषा पहचान, कॉन्फ़िगरेशन, प्रदाता, और अनुवाद कार्यक्षमता के लिए कस्टम हुक शामिल हैं।",
  "stepFive.title": "चरण 5: layout.tsx लपेटें",
  "stepFive.paragraphOne": "हम layout घटक को I18NextHtmlProvider के साथ लपेटने जा रहे हैं।",
  "stepSix.title": "चरण 6: प्रकार जनरेट करें",
  "stepSix.paragraph": "जब तक हम अनुवादों का उपयोग करने के लिए शुरू नहीं करेंगे, चलिए प्रकार जनरेट करते हैं। यह useTranslation हुक का उपयोग करते समय हमें प्रकार पूर्णता में मदद करेगा। हम npx myelino upsert चला सकते हैं और i18next.d.ts का चयन कर सकते हैं। इससे types निर्देशिका के तहत एक कस्टम प्रकार जनरेट होगा।",
  "stepSeven.title": "चरण 7: अनुवादों का उपयोग करें",
  "stepSeven.paragraphOne": "कस्टम प्रकार जनरेट करने के बाद, हम कस्टम useTranslation हुक का उपयोग कर सकते हैं जैसे:",
  "stepSeven.paragraphTwo": "आप namespaces टाइप करते समय प्रकार पूर्णता नोटिस करेंगे। यह पिछले चरण में प्रकार जनरेट करने से पहले है।",
  "stepSeven.paragraphThree": "हम फ्रंटएंड सेक्शन के साथ समाप्त कर चुके हैं। अब मजेदार भाग, Myelin AI के साथ मल्टी लिंगुअल अनुवाद।",
  "partTwo.title": "भाग बी: Myelin AI के साथ मल्टी लिंगुअल अनुवाद",
  "partTwo.intro": "परिचय",
  "partTwo.intro.paragraphOne": "ठीक है, अब जब हमारे पास फ्रंटएंड है, हम अपने अनुवाद अवसंरचना पाइपलाइन को Myelin के साथ शुरू करने के लिए तैयार हैं।",
  "partTwo.intro.paragraphTwo": "Myelin एक ओपन सोर्स लोकल फर्स्ट अनुवाद अवसंरचना है, जो मल्टी भाषा अनुवाद को प्रबंधित, सिंक और चलाने के लिए सुपर आसान बनाता है। इसका उपयोग करने का पहला कदम इसे प्रारंभ करना है।",
  "partTwo.intro.paragraphThree": "आपसे स्रोत अनुवाद, लक्षित अनुवाद और आपके द्वारा चुनी गई AI सेवा प्रदाता प्रदान करने के लिए कहा जाएगा। यदि आप चाहें तो आप कस्टम AI प्रदाता भी जोड़ सकते हैं। चीजों को सरल रखने के लिए हम openai को चुनने जा रहे हैं।",
  "partTwo.intro.paragraphFour": "आपको अपनी API कुंजी प्राप्त करने और इसे .env फाइल में सहेजने की भी आवश्यकता होगी।",
  "partTwo.translate.title": "अनुवाद करें",
  "partTwo.translate.paragraphOne": "अब हम अनुवाद पाइपलाइन चलाने के लिए तैयार हैं। हम ऐसा निम्नलिखित कमांड के साथ कर सकते हैं",
  "partTwo.translate.paragraphTwo": "जब आप इस कमांड को चलाते हैं, Myelin आपके स्रोत JSON फ़ाइलों (जैसे locales/en/common.json) को लोड करता है, किसी भी नए या अपडेट किए गए अनुवाद स्ट्रिंग्स की पहचान करता है, आपके निर्दिष्ट लक्षित भाषाओं के लिए अनुवाद उत्पन्न करता है, और संबंधित लक्षित भाषा JSON नामस्पेस फ़ाइलों (जैसे locales/fr/common.json, locales/es/common.json, locales/zh/common.json) को बनाता या अपडेट करता है।",
  "partTwo.translate.paragraphThree": "यह जांचने के लिए कि यह वास्तव में काम कर रहा है या नहीं, हम भाषा-स्विचर घटक आयात कर सकते हैं।",
  "partTwo.translate.note": "नोट: भाषा-स्विचर निम्नलिखित चाडसीएन घटकों: ड्रॉपडाउन-मेनू और बटन पर बनाया गया है। उन्हें स्थापित करने के लिए, कृपया इस स्क्रिप्ट का उपयोग करें:",
  "conclusion": "और बस इतना ही, आपने अपनी खुद की बहुभाषी ऐप बनाई है, चाद्कन शैली में। बहुत अच्छा!"
}
