{
  "blog.title": "تطبيق متعدد اللغات مع NextJS و i18next و Myelin AI",
  "blog.description": "في هذا البرنامج التعليمي سنتعلم كيفية ترجمة تطبيق NextJS الخاص بك إلى عدة لغات باستخدام i18next و Myelin AI.",
  "titleOne": "الجزء الأول: الواجهة الأمامية",
  "stepOne.title": "الخطوة 1: إنشاء مشروع NextJS",
  "stepOne.paragraphOne": "سنقوم بتشغيل هذا الأمر لبدء مشروع Next.js جديد.",
  "stepTwo.title": "الخطوة 2: إضافة chadcn",
  "stepTwo.paragraphOne": "في الخطوة التالية، دعنا نضيف chadcn إلى مشروعنا. تُستوحى Myelin بشكل كبير من chadcn وتستخدم العديد من مبادئها ككتل بناء لإنشاء مكونات مخصصة مثل محول اللغة.",
  "stepThree.title": "الخطوة 3: إضافة اللغات",
  "stepThree.paragraphOne": "بعد ذلك، دعنا نضيف اللغات إلى تطبيقنا. سنقوم بإنشاء لغة واحدة مسماة common.json داخل دليل locales/en. تدعم Myelin اللغات المسماة وغير المسماة، لكنني أشجعك بشدة على الالتزام باللغات المسماة.",
  "stepFour.title": "الخطوة 4: أضف كود العينة لـ i18next",
  "stepFour.paragraphOne": "الخطوة التالية هي إضافة i18n-next والأصدقاء إلى تطبيقنا. يمكننا استخدام الأمر التالي للقيام بذلك:",
  "stepFour.paragraphTwo": "سيؤدي تشغيل هذا إلى ما يلي:",
  "stepFour.paragraphThree": "تثبيت مكتبة i18next الأساسية والوحدات الإضافية لاكتشاف اللغة، وسلسلة النماذج الخلفية، وتحويل الموارد.",
  "stepFour.paragraphFour": "تنفيذ وظائف ومكونات مساعدة متنوعة في دليل libs/i18n-next، بما في ذلك إدارة ملفات تعريف الارتباط، واكتشاف اللغة، والتكوين، ومقدمي الخدمة، وأقواس مخصصة لوظيفة الترجمة.",
  "stepFive.title": "الخطوة 5: لف layout.tsx",
  "stepFive.paragraphOne": "سوف نقوم بلف مكون التخطيط مع I18NextHtmlProvider",
  "stepSix.title": "الخطوة 6: توليد الأنواع",
  "stepSix.paragraph": "قبل أن نبدأ في استخدام الترجمات، دعنا نقوم بتوليد الأنواع. سيساعدنا ذلك في إكمال الأنواع عند استخدام خطاف useTranslation. يمكننا تشغيل npx myelino upsert واختيار i18next.d.ts. سيؤدي ذلك إلى توليد أنواع مخصصة تحت دليل الأنواع.",
  "stepSeven.title": "الخطوة 7: استخدم الترجمات",
  "stepSeven.paragraphOne": "مع أنواع مخصصة تم إنشاؤها، يمكننا استخدام خطاف useTranslation المخصص هكذا:",
  "stepSeven.paragraphTwo": "ستلاحظ إكمال الأنواع عند كتابة الأسماء المستعارة. هذا قبل أن نقوم بإنشاء الأنواع في الخطوة السابقة.",
  "stepSeven.paragraphThree": "لقد انتهينا من قسم الواجهة الأمامية. الآن الجزء الممتع، الترجمات متعددة اللغات مع Myelin AI."
}
